test_cases/3d/aero_3h_3d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table (
    (0.00000 (0.05752 0 0))
    (0.05000 (0.30117 0 0))
    (0.10000 (0.36225 0 0))
    (0.15000 (0.40357 0 0))
    (0.20000 (0.43571 0 0))
    (0.25000 (0.46239 0 0))
    (0.30000 (0.48541 0 0))
    (0.35000 (0.50575 0 0))
    (0.40000 (0.52407 0 0))
    (0.45000 (0.54077 0 0))
    (0.50000 (0.55616 0 0))
    (0.55000 (0.57046 0 0))
    (0.60000 (0.58384 0 0))
    (0.65000 (0.59642 0 0))
    (0.70000 (0.60831 0 0))
    (0.75000 (0.61960 0 0))
    (0.80000 (0.63034 0 0))
    (0.85000 (0.64060 0 0))
    (0.90000 (0.65043 0 0))
    (0.95000 (0.65987 0 0))
    (1.00000 (0.66895 0 0))
    (1.05000 (0.67770 0 0))
    (1.10000 (0.68615 0 0))
    (1.15000 (0.69432 0 0))
    (1.20000 (0.70224 0 0))
    (1.25000 (0.70992 0 0))
    (1.30000 (0.71737 0 0))
    (1.35000 (0.72462 0 0))
    (1.40000 (0.73168 0 0))
    (1.45000 (0.73855 0 0))
    (1.50000 (0.74525 0 0))
    (1.55000 (0.75178 0 0))
    (1.60000 (0.75817 0 0))
    (1.65000 (0.76441 0 0))
    (1.70000 (0.77051 0 0))
    (1.75000 (0.77649 0 0))
    (1.80000 (0.78234 0 0))
    (1.85000 (0.78807 0 0))
    (1.90000 (0.79368 0 0))
    (1.95000 (0.79920 0 0))
    (2.00000 (0.80460 0 0))
    (2.05000 (0.80991 0 0))
    (2.10000 (0.81513 0 0))
    (2.15000 (0.82025 0 0))
    (2.20000 (0.82529 0 0))
    (2.25000 (0.83025 0 0))
    (2.30000 (0.83512 0 0))
    (2.35000 (0.83992 0 0))
    (2.40000 (0.84465 0 0))
    (2.45000 (0.84930 0 0))
    (2.50000 (0.85388 0 0))
    (2.55000 (0.85840 0 0))
    (2.60000 (0.86285 0 0))
    (2.65000 (0.86724 0 0))
    (2.70000 (0.87157 0 0))
    (2.75000 (0.87584 0 0))
    (2.80000 (0.88005 0 0))
    (2.85000 (0.88421 0 0))
    (2.90000 (0.88832 0 0))
    (2.95000 (0.89237 0 0))
    (3.00000 (0.89638 0 0))
    (3.05000 (0.90033 0 0))
    (3.10000 (0.90424 0 0))
    (3.15000 (0.90810 0 0))
    (3.20000 (0.91192 0 0))
    (3.25000 (0.91569 0 0))
    (3.30000 (0.91943 0 0))
    (3.35000 (0.92312 0 0))
    (3.40000 (0.92677 0 0))
    (3.45000 (0.93038 0 0))
    (3.50000 (0.93395 0 0))
    (3.55000 (0.93749 0 0))
    (3.60000 (0.94099 0 0))
    (3.65000 (0.94445 0 0))
    (3.70000 (0.94788 0 0))
    (3.75000 (0.95127 0 0))
    (3.80000 (0.95464 0 0))
    (3.85000 (0.95797 0 0))
    (3.90000 (0.96126 0 0))
    (3.95000 (0.96453 0 0))
    (4.00000 (0.96777 0 0))
    (4.05000 (0.97098 0 0))
    (4.10000 (0.97416 0 0))
    (4.15000 (0.97731 0 0))
    (4.20000 (0.98043 0 0))
    (4.25000 (0.98353 0 0))
    (4.30000 (0.98659 0 0))
    (4.35000 (0.98964 0 0))
    (4.40000 (0.99266 0 0))
    (4.45000 (0.99565 0 0))
    (4.50000 (0.99862 0 0))
    (4.55000 (1.00156 0 0))
    (4.60000 (1.00448 0 0))
    (4.65000 (1.00738 0 0))
    (4.70000 (1.01025 0 0))
    (4.75000 (1.01310 0 0))
    (4.80000 (1.01593 0 0))
    (4.85000 (1.01874 0 0))
    (4.90000 (1.02153 0 0))
    (4.95000 (1.02429 0 0))
    (5.00000 (1.02704 0 0))
    (5.05000 (1.02977 0 0))
    (5.10000 (1.03247 0 0))
    (5.15000 (1.03516 0 0))
    (5.20000 (1.03783 0 0))
    (5.25000 (1.04048 0 0))
    (5.30000 (1.04311 0 0))
    (5.35000 (1.04572 0 0))
    (5.40000 (1.04831 0 0))
    (5.45000 (1.05089 0 0))
    (5.50000 (1.05345 0 0))
    (5.55000 (1.05599 0 0))
    (5.60000 (1.05852 0 0))
    (5.65000 (1.06103 0 0))
    (5.70000 (1.06352 0 0))
    (5.75000 (1.06600 0 0))
    (5.80000 (1.06846 0 0))
    (5.85000 (1.07091 0 0))
    (5.90000 (1.07334 0 0))
    (5.95000 (1.07575 0 0))
    (6.00000 (1.07815 0 0))
    (6.05000 (1.08054 0 0))
    (6.10000 (1.08291 0 0))
    (6.15000 (1.08527 0 0))
    (6.20000 (1.08761 0 0))
    (6.25000 (1.08994 0 0))
    (6.30000 (1.09226 0 0))
    (6.35000 (1.09456 0 0))
    (6.40000 (1.09685 0 0))
    (6.45000 (1.09912 0 0))
    (6.50000 (1.10139 0 0))
    (6.55000 (1.10364 0 0))
    (6.60000 (1.10588 0 0))
    (6.65000 (1.10810 0 0))
    (6.70000 (1.11032 0 0))
    (6.75000 (1.11252 0 0))
    (6.80000 (1.11471 0 0))
    (6.85000 (1.11688 0 0))
    (6.90000 (1.11905 0 0))
    (6.95000 (1.12120 0 0))
    (7.00000 (1.12335 0 0))
    (7.05000 (1.12548 0 0))
    (7.10000 (1.12760 0 0))
    (7.15000 (1.12971 0 0))
    (7.20000 (1.13181 0 0))
    (7.25000 (1.13390 0 0))
    (7.30000 (1.13597 0 0))
    (7.35000 (1.13804 0 0))
    (7.40000 (1.14010 0 0))
    (7.45000 (1.14215 0 0))
    (7.50000 (1.14418 0 0))
    (7.55000 (1.14621 0 0))
    (7.60000 (1.14823 0 0))
    (7.65000 (1.15024 0 0))
    (7.70000 (1.15223 0 0))
    (7.75000 (1.15422 0 0))
    (7.80000 (1.15620 0 0))
    (7.85000 (1.15817 0 0))
    (7.90000 (1.16013 0 0))
    (7.95000 (1.16208 0 0))
    (8.00000 (1.16402 0 0))
    (8.05000 (1.16596 0 0))
    (8.10000 (1.16788 0 0))
    (8.15000 (1.16980 0 0))
    (8.20000 (1.17171 0 0))
    (8.25000 (1.17361 0 0))
    (8.30000 (1.17550 0 0))
    (8.35000 (1.17738 0 0))
    (8.40000 (1.17925 0 0))
    (8.45000 (1.18112 0 0))
    (8.50000 (1.18298 0 0))
    (8.55000 (1.18483 0 0))
    (8.60000 (1.18667 0 0))
    (8.65000 (1.18850 0 0))
);
        direction       (0 0 1);
        origin          0;
    }
    outlet    { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    ground    { type noSlip; }
    buildings { type noSlip; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
