test_cases/3d/aero_3h_3d/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    buildingCells; type cellSet; action new;
        source  boxToCell; box (14.6186 4.7118 0)(15.0786 5.2092 3.5768);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9905 5.4765 0)(6.6272 5.8857 4.6076);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5025 1.1415 0)(7.8649 1.5188 3.2777);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5824 4.2897 0)(12.3019 4.7713 2.3355);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4261 8.3063 0)(14.0811 8.6878 4.7075);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.3084 6.8661 0)(12.9423 7.215 2.2035);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.0416 5.7864 0)(11.4083 6.2953 3.5451);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.5789 1.7549 0)(14.3339 2.281 2.4758);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3447 4.2605 0)(6.0726 4.8589 5.3355);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.5754 3.3031 0)(15.2522 3.8265 3.7418);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.587 2.8017 0)(6.9328 3.375 3.4471);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.7615 7.1554 0)(9.3715 7.6485 3.1434);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2085 2.092 0)(7.5174 2.6583 2.5197);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.4751 6.1551 0)(17.036 6.5862 4.2202);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5045 7.0196 0)(5.9384 7.561 5.6172);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0249 1.5045 0)(5.3457 1.8154 3.5276);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8795 2.4226 0)(12.2608 2.8603 2.496);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.8944 1.959 0)(5.2612 2.4481 3.2431);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.3131 6.1068 0)(9.6982 6.4174 4.6311);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.54 8.5484 0)(12.9948 8.8693 3.5436);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.6868 2.8009 0)(16.3753 3.1738 3.6717);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.4174 5.007 0)(15.8256 5.3365 4.5801);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.4949 6.7013 0)(10.2781 7.2748 2.4993);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.3794 1.1483 0)(6.9157 1.6786 3.9693);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7919 5.0311 0)(5.4597 5.5443 5.0624);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.6693 3.9973 0)(13.3794 4.5903 4.8656);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.2597 3.2862 0)(15.6072 3.7264 5.3011);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.025 1.8519 0)(4.7599 2.2962 3.0601);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.5427 8.2812 0)(9.2096 8.7514 3.5046);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0577 5.0861 0)(8.8033 5.5172 5.3147);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.141 8.4295 0)(11.6281 8.7544 2.3807);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.9412 4.2585 0)(7.6049 4.7489 4.9273);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.6572 7.3398 0)(14.3677 7.7221 4.6778);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.2139 6.5523 0)(6.6017 7.0719 4.1976);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.9878 5.7616 0)(16.7117 6.0697 4.9333);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.4775 6.3481 0)(9.2167 6.7547 2.4316);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5096 2.9291 0)(11.8344 3.3647 5.5859);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.7211 9.0057 0)(17.2169 9.4678 5.4642);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.3897 4.3043 0)(4.8271 4.7289 5.3673);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.0482 8.3694 0)(4.8307 8.8317 4.1983);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.6157 5.3081 0)(11.314 5.6955 2.2512);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.927 6.7691 0)(15.2524 7.1803 4.385);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.8551 2.9114 0)(9.3319 3.3787 2.1676);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.452 8.6745 0)(15.9225 9.0545 2.7788);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0415 7.2218 0)(12.555 7.5738 2.728);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.3751 2.8651 0)(4.0794 3.3978 2.5806);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.663 3.3091 0)(10.0452 3.773 3.5521);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.0254 4.6209 0)(9.3328 5.0359 5.6024);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.1979 7.3135 0)(6.6701 7.816 5.0931);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.9524 1.1025 0)(4.4747 1.447 5.2177);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.2193 2.6676 0)(17.5476 3.0085 3.7509);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.6152 4.7822 0)(12.0222 5.262 3.6005);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.0822 7.7043 0)(16.4159 8.2931 5.5629);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.4919 8.1745 0)(3.9935 8.7 4.3914);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7252 8.4352 0)(12.2083 8.7728 3.2901);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.4679 5.864 0)(11.8201 6.3452 4.4877);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.7859 4.2024 0)(16.1025 4.6088 3.8257);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.5954 5.7585 0)(18.1547 6.2607 2.5009);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.8623 1.3759 0)(11.6056 1.8598 4.2965);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0431 8.8973 0)(12.5977 9.2652 5.5395);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.1017 6.8788 0)(11.5908 7.2647 4.903);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3043 8.3733 0)(5.7569 8.7123 5.1409);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8395 8.4033 0)(10.1488 8.8193 4.746);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.1258 2.3792 0)(14.6587 2.9295 5.2213);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0427 4.831 0)(12.5215 5.243 4.0828);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.4413 3.9345 0)(16.7547 4.275 4.6555);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.0377 3.5941 0)(7.5554 4.003 2.3734);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.3811 8.0062 0)(6.8386 8.3163 3.6765);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.4844 3.354 0)(6.0495 3.8149 2.3546);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.508 8.8512 0)(18.1933 9.4278 4.0725);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3643 7.4688 0)(7.8806 8.0061 5.5165);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.5305 9.1727 0)(11.3133 9.6275 3.7165);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8344 3.6194 0)(14.3636 4.2033 4.4957);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.2782 6.1724 0)(6.7166 6.4776 3.31);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0261 4.2975 0)(8.777 4.8081 2.9236);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.5926 2.1285 0)(13.1486 2.534 2.2706);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.3589 2.6806 0)(13.0369 3.0163 4.8941);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1014 7.6872 0)(15.6361 8.0188 3.2888);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.1519 6.5931 0)(4.6705 6.9267 2.9119);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.4344 3.2262 0)(11.0554 3.6369 3.2682);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.0394 1.1239 0)(7.4544 1.691 3.6346);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1796 5.1715 0)(17.6236 5.5887 3.085);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.1841 5.9592 0)(12.6012 6.3249 4.0295);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.2647 3.4379 0)(6.72 3.9584 4.3318);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.2614 6.7848 0)(17.7704 7.188 3.2166);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.1237 2.117 0)(8.4837 2.6126 3.3336);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.825 7.6219 0)(7.304 7.9636 4.5907);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.3941 4.0207 0)(14.8814 4.5426 3.451);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.8497 3.6711 0)(17.3856 4.1341 2.7974);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1448 4.2651 0)(17.5407 4.7466 4.0208);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.8853 8.2245 0)(8.2928 8.6455 4.4085);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.5859 8.2529 0)(16.9877 8.6853 2.7304);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.1763 3.68 0)(10.9299 4.1899 2.7765);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.6416 2.3741 0)(3.9644 2.6966 2.4893);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7208 3.4401 0)(8.2487 3.858 4.7975);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.2298 6.8013 0)(13.8439 7.2978 2.6763);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.0267 1.2434 0)(9.8176 1.637 4.5026);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.4327 6.2246 0)(4.0033 6.6633 3.4974);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9441 2.049 0)(10.3859 2.4946 2.4181);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.7308 5.6962 0)(10.2183 6.1946 2.5034);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.6578 3.0761 0)(14.446 3.4398 4.5959);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8164 1.2185 0)(14.5791 1.5751 4.1344);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.1016 5.093 0)(4.7315 5.6528 4.6479);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.9147 6.6195 0)(16.6743 7.0859 2.6775);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.9264 4.7865 0)(16.5373 5.2886 3.4918);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.3505 5.2572 0)(13.1425 5.7511 3.19);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3523 8.063 0)(7.7489 8.5404 4.5074);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.667 2.0471 0)(16.391 2.5889 3.6248);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.5311 3.0889 0)(16.8559 3.5617 4.915);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0123 7.8243 0)(12.5334 8.2157 3.8798);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.0429 1.0988 0)(15.6853 1.6125 4.33);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.0766 9.3638 0)(6.5141 9.6662 2.3812);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7231 8.8749 0)(4.3176 9.3117 4.3485);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.2198 1.8204 0)(9.7894 2.3572 3.4289);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.454 5.4426 0)(7.8709 5.7727 4.3483);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.2663 9.0579 0)(13.6556 9.4141 2.739);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.9217 6.7176 0)(8.3803 7.3168 3.9963);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.5526 3.8571 0)(4.1515 4.4327 3.6194);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.3816 6.5573 0)(10.9563 7.0792 2.886);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.9438 6.6721 0)(14.718 7.1683 3.1866);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5434 1.3911 0)(5.925 1.8884 3.671);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5145 6.5067 0)(6.1898 6.8171 2.6764);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7046 7.3913 0)(5.3357 7.8993 3.8732);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.1707 8.4465 0)(14.7809 9.0114 4.4404);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3191 1.2807 0)(8.7146 1.6787 3.0128);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.1852 8.0084 0)(11.7837 8.3473 5.2312);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5089 6.4617 0)(7.8176 6.8337 4.0431);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2952 7.4251 0)(11.0051 7.7277 3.3431);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.1255 7.7871 0)(9.6586 8.1004 4.7329);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.8954 6.3861 0)(15.5404 6.7253 5.179);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1171 5.7963 0)(15.7818 6.3216 2.2262);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.3147 6.6955 0)(3.9289 7.0213 3.979);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.1254 2.2866 0)(6.4722 2.8806 3.8345);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.8858 8.8405 0)(7.4863 9.3757 5.4576);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.7119 3.2686 0)(16.4441 3.7276 3.7287);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6446 4.7698 0)(10.1727 5.3137 2.7257);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.4397 7.4145 0)(17.1575 7.7885 3.3122);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.2589 1.5127 0)(12.6859 1.9355 3.2133);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3184 5.7516 0)(8.7571 6.1221 4.4268);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.1083 3.0817 0)(4.8758 3.3968 5.1142);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5588 8.6952 0)(8.024 9.0722 2.8188);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.9355 9.0157 0)(9.7185 9.3481 2.5195);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7342 1.2521 0)(13.1949 1.5816 4.4634);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.4064 1.6214 0)(17.8966 2.1758 2.2074);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5529 9.2778 0)(12.1549 9.6953 3.6109);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.133 4.2405 0)(10.4355 4.6622 3.5606);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7873 9.0154 0)(5.5671 9.4429 2.995);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.368 7.1018 0)(15.8125 7.609 3.8777);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.5402 5.3857 0)(13.8709 5.7989 3.5398);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.7046 2.6076 0)(11.0104 3.0514 2.9995);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.3315 6.2646 0)(14.0594 6.5735 3.4064);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.9435 6.1241 0)(5.7364 6.4639 5.1969);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.5624 3.5085 0)(5.0223 4.0781 4.9188);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7875 7.7426 0)(13.5466 8.075 3.2661);
    }
    {
        name    fluid; type cellSet; action new;
        source  cellToCell; set buildingCells;
    }
    {
        name    fluid; type cellSet; action invert;
    }
);

// ************************************************************************* //
